pok3r-custom/pok3r_re_firmware/firmware/board/ht32/ht32f1655.h
STRUCT_SIZE_ASSERT(AHBCCR_reg, 4);

// APBCFGR
STRUCT_REGISTER_START {
    u32             : 16;
    u32 ADCDIV      : 3;    //!< A/D Converter Clock Frequency Division Selection
    u32             : 13;
} STRUCT_REGISTER_END APBCFGR_reg;
STRUCT_SIZE_ASSERT(APBCFGR_reg, 4);

// APBCCR0
STRUCT_REGISTER_START {
    u32 I2C0EN      : 1;    //!< I2C 0 Clock Enable
    u32 I2C1EN      : 1;    //!< I2C 1 Clock Enable
    u32             : 2;
    u32 SPI0EN      : 1;    //!< SPI 0 Clock Enable
    u32 SPI1EN      : 1;    //!< SPI 1 Clock Enable
    u32             : 2;
    u32 USR0EN      : 1;    //!< USART 0 Clock Enable
    u32 USR1EN      : 1;    //!< USART 1 Clock Enable
    u32 UR0EN       : 1;    //!< UART 0 Clock Enable
    u32 UR1EN       : 1;    //!< UART 1 Clock Enable
    u32             : 2;
    u32 AFIOEN      : 1;    //!< Alternate Function I/O Clock Enable
    u32 EXTIEN      : 1;    //!< External Interrupt Clock Enable
    u32             : 8;
    u32 SCIEN       : 1;    //!< Smart Card Interface Clock Enable
    u32 I2SEN       : 1;    //!< I2S Clock Enable
    u32             : 6;
} STRUCT_REGISTER_END APBCCR0_reg;
STRUCT_SIZE_ASSERT(APBCCR0_reg, 4);

// APBCCR1
STRUCT_REGISTER_START {
    u32 MCTM0EN     : 1;    //!< MCTM 0 Clock Enable
    u32 MCTM1EN     : 1;    //!< MCTM 1 Clock Enable
    u32             : 2;
    u32 WDTREN      : 1;    //!< Watchdog Timer Registers Access Enable
    u32             : 1;
    u32 BKPREN      : 1;    //!< Backup Domain Registers Access Enable
    u32             : 1;
    u32 GPTM0EN     : 1;    //!< GPTM 0 Clock Enable
    u32 GPTM1EN     : 1;    //!< GPTM 1 Clock Enable
    u32             : 6;
    u32 BFTM0EN     : 1;    //!< BFTM 0 Clock Enable
    u32 BFTM1EN     : 1;    //!< BFTM 1 Clock Enable
    u32             : 4;
    u32 OPA0EN      : 1;    //!< OPA/CMP 0 Clock Enable
    u32 OPA1EN      : 1;    //!< OPA/CMP 1 Clock Enable
    u32 ADCEN       : 1;    //!< ADC Clock Enable
    u32             : 7;
} STRUCT_REGISTER_END APBCCR1_reg;
STRUCT_SIZE_ASSERT(APBCCR1_reg, 4);

// CKST
STRUCT_REGISTER_START {
    u32             : 8;
    u32 PLLST       : 4;    //!< PLL Clock Occupation Status
    u32             : 4;
    u32 HSEST       : 2;    //!< High Speed External Clock Occupation Status
    u32             : 6;
    u32 HSIST       : 3;    //!< High Speed Internal Clock Occupation Status
    u32             : 3;
    u32 CKSWST      : 2;    //!< Clock Switch Status
} STRUCT_REGISTER_END CKST_reg;
STRUCT_SIZE_ASSERT(CKST_reg, 4);

// LPCR
STRUCT_REGISTER_START {
    u32 BKISO       : 1;    //!< Backup Domain Isolation Control
    u32             : 7;
    u32 USBSLEEP    : 1;    //!< USB Sleep Software Control Enable
    u32             : 23;
} STRUCT_REGISTER_END LPCR_reg;
STRUCT_SIZE_ASSERT(LPCR_reg, 4);

// MCUDBGCR
STRUCT_REGISTER_START {
    u32 DBSLP       : 1;    //!< Debug Sleep Mode
    u32 DBDSLP1     : 1;    //!< Debug Deep-Sleep1
    u32 DBPD        : 1;    //!< Debug Power-Down Mode
    u32 DBWDT       : 1;    //!< Watchdog Timer Debug Mode Enable
    u32 DBMCTM0     : 1;    //!< MCTM 0 Debug Mode Enable
    u32 DBMCTM1     : 1;    //!< MCTM 1 Debug Mode Enable
    u32 DBGPTM0     : 1;    //!< GPTM 0 Debug Mode Enable
    u32 DBGPTM1     : 1;    //!< GPTM 1 Debug Mode Enable
    u32 DBUSR0      : 1;    //!< USART 0 Debug Mode Enable
    u32 DBUSR1      : 1;    //!< USART 1 Debug Mode Enable
    u32 DBSPI0      : 1;    //!< SPI 0 Debug Mode Enable
    u32 DBSPI1      : 1;    //!< SPI 1 Debug Mode Enable
    u32 DBI2C0      : 1;    //!< I2C 0 Debug Mode Enable
    u32 DBI2C1      : 1;    //!< I2C 1 Debug Mode Enable
    u32 DBDSLP2     : 1;    //!< Debug Deep-Sleep2
    u32 DBSCI       : 1;    //!< SCI Debug Mode Enable
    u32 DBBFTM0     : 1;    //!< BFTM 0 Debug Mode Enable
    u32 DBBFTM1     : 1;    //!< BFTM 1 Debug Mode Enable
    u32 DBUR0       : 1;    //!< UART 0 Debug Mode Enable
    u32 DBUR1       : 1;    //!< UART 1 Debug Mode Enable
    u32 DBTRACE     : 1;    //!< TRACESWO Debug Mode Enable
    u32             : 11;
} STRUCT_REGISTER_END MCUDBGCR_reg;
STRUCT_SIZE_ASSERT(MCUDBGCR_reg, 4);

// CKCU
typedef struct {
    GCFGR_reg GCFGR;        //!< Global Clock Configuration
    GCCR_reg GCCR;          //!< Global Clock Control
    GCSR_reg GCSR;          //!< Global Clock Status
    GCIR_reg GCIR;          //!< Global Clock Interrupt
    u8 _pad1[0x8];

    // 0x018
    PLLCFGR_reg PLLCFGR;    //!< PLL Configuration
    PLLCR_reg PLLCR;        //!< PLL Control
    AHBCFGR_reg AHBCFGR;    //!< AHB Configuration
    AHBCCR_reg AHBCCR;      //!< AHB Clock Control
    APBCFGR_reg APBCFGR;    //!< APB Configuration
    APBCCR0_reg APBCCR0;    //!< APB Clock Control 0
    APBCCR1_reg APBCCR1;    //!< APB Clock Control 1
    CKST_reg CKST;          //!< Clock Source Status
    u8 _pad2[0x2c8];

    // 0x300
    LPCR_reg LPCR;          //!< Low Power Control
    MCUDBGCR_reg MCUDBGCR;  //!< MCU Debug Control
} CKCU_map;
STRUCT_SIZE_ASSERT(CKCU_map, 0x308);

#define REG_CKCU ((volatile CKCU_map *)CKCU_BASE)

STRUCT_REG_CHECK(CKCU, GCFGR);
STRUCT_REG_CHECK(CKCU, GCCR);
STRUCT_REG_CHECK(CKCU, GCSR);
STRUCT_REG_CHECK(CKCU, GCIR);
STRUCT_REG_CHECK(CKCU, PLLCFGR);
STRUCT_REG_CHECK(CKCU, PLLCR);
STRUCT_REG_CHECK(CKCU, AHBCFGR);
STRUCT_REG_CHECK(CKCU, AHBCCR);
STRUCT_REG_CHECK(CKCU, APBCFGR);
STRUCT_REG_CHECK(CKCU, APBCCR0);
STRUCT_REG_CHECK(CKCU, APBCCR1);
STRUCT_REG_CHECK(CKCU, CKST);
STRUCT_REG_CHECK(CKCU, LPCR);
STRUCT_REG_CHECK(CKCU, MCUDBGCR);

// Reset Control Unit
// ////////////////////////////////////////////////////////////////////////////////////////////////
#define RSTCU_GPSR          RSTCU_BASE + 0x100  // Global Reset Status
#define RSTCU_AHBPRSTR      RSTCU_BASE + 0x104  // AHB Peripheral Reset
#define RSTCU_APBPRSTR0     RSTCU_BASE + 0x108  // APB Peripheral Reset 0
#define RSTCU_APBPRSTR1     RSTCU_BASE + 0x10C  // APB Peripheral Reset 1

STRUCT_REGISTER_START {
    u32 SYSRSTF : 1;    //!< System Reset Flag
    u32 EXTRSTF : 1;    //!< External Pin Reset Flag
    u32 WDTRSTF : 1;    //!< Watchdog Timer Reset Flag
    u32 PORSTF  : 1;    //!< Core 1.8V Power On Reset Flag
    u32         : 28;
} STRUCT_REGISTER_END GPSR_reg;
STRUCT_SIZE_ASSERT(GPSR_reg, 4);

STRUCT_REGISTER_START {
    u32 DMARST  : 1;    //!< PDMA Reset Control
    u32         : 4;
    u32 USBRST  : 1;    //!< USB Reset Control
    u32 EBIRST  : 1;    //!< EBI Reset Control
    u32 CRCRST  : 1;    //!< CRC Reset Control
    u32 PARST   : 1;    //!< GPIO Port A Reset Control
    u32 PBRST   : 1;    //!< GPIO Port B Reset Control
    u32 PCRST   : 1;    //!< GPIO Port C Reset Control
    u32 PDRST   : 1;    //!< GPIO Port D Reset Control
    u32 PERST   : 1;    //!< GPIO Port E Reset Control
    u32         : 19;
} STRUCT_REGISTER_END AHBPRSTR_reg;
STRUCT_SIZE_ASSERT(AHBPRSTR_reg, 4);

STRUCT_REGISTER_START {
    u32 I2C0RST : 1;    //!< I2C 0 Reset Control
    u32 I2C1RST : 1;    //!< I2C 1 Reset Control
    u32         : 2;
    u32 SPI0RST : 1;    //!< SPI 0 Reset Control
    u32 SPI1RST : 1;    //!< SPI 1 Reset Control
    u32         : 2;
    u32 USR0RST : 1;    //!< USART 0 Reset Control
    u32 USR1RST : 1;    //!< USART 1 Reset Control
    u32 UR0RST  : 1;    //!< UART 0 Reset Control
    u32 UR1RST  : 1;    //!< UART 1 Reset Control
    u32         : 2;
    u32 AFIORST : 1;    //!< Alternate Function Reset Control
    u32 EXTIRST : 1;    //!< External Interface Reset Control
    u32         : 8;
    u32 SCIRST  : 1;    //!< SCI Reset Control
    u32 I2SRST  : 1;    //!< I2S Reset Control
    u32         : 6;
} STRUCT_REGISTER_END APBPRSTR0_reg;
